{"Type":"Text","Title":"Privacy policy","Sections":[{"Title":"Data we collect:","Content":"None.\n\n<b>You can verify this by yourself</b>: the RookieHPC website is hosted on Github pages and its source code is publicly available."},{"Title":"SSL encryption","Content":"The RookieHPC website is hosted on Github pages, with enforced HTTPS encryption enabled. It uses a secure connection as you can see in the URL bar, which has a URL beginning with \"https://\" or displays a little lock icon. Thus, the communications between your browser and our server are encrypted using SSL and cannot be read by third parties."},{"Title":"HSTS preloaded","Content":"In addition to securing your connection over HTTPS, the RookieHPC website and your browser go further and team up to make sure that every single interaction they have cannot be anything else but secure, even if a malicious entity on the network was trying to make you do otherwise. This is achieved in two steps:\n\t-The server-side, us, guarantees that if we receive a request to access the unsecure HTTP version of a page, we automatically return the secure HTTPS version of that page instead.\n\t-The client-side, your browser, guarantees that it will never send us a request for an unsecure HTTP version of a page at all. To achieve this, we are registered in the trusted <a href='https://hstspreload.org/?domain=www.rookiehpc.com'>HSTS preload list</a>, which requires to demonstrate a list of security features, including the automatic redirection to HTTPS. Your browser regularly checks out that list and knows that websites registered in it are HTTPS-only websites. So, if your browser is asked to send us a request for an unsecure HTTP version of a page, it knows that it does not make sense and automatically sends a request for the secure HTTPS version of that page instead.\nIn a nutshell, we always serve the secure HTTPS version of pages and your browser always sends us requests for the secure HTTPS version of pages; we have you covered."}]}